# Домашнее задание  6
# Домашнее задание на тему "Словари в автоматизации":
#
# Задание 1:
# 1. Ознакомьтесь с понятием словарей в Python и узнайте, для чего они используются в автоматизации.
# 2. Создайте словарь `student`, который будет содержать информацию о студенте:
#   - Имя студента (ключ: "name")
#   - Возраст студента (ключ: "age")
#   - Список предметов (type list), которые он изучает (ключ: "subjects")
#   - Средний балл (ключ: "average_score")
student = {
    "name" : "Mila",
    "age" : 21,
    "subjects" : ["M", "A", "D"],
    "average_score" : "hjjfjfjf"
    }
type_list = student
print(type_list["subjects"])
print(student)




# 3. Выведите на экран значение каждого ключа из словаря `student` с помощью доступа к элементам по ключу.
# 4. Обновите значение ключа "average_score" в словаре `student` на новое значение (например, 4.75).
# 5. Добавьте новый предмет в список предметов студента (например, "Физика").
# 6. Удалите ключ "age" из словаря `student`, так как эта информация больше не нужна.
# 7. Проверьте наличие ключей "age" и "gender" в словаре `student`. Выведите соответствующее сообщение, если ключ существует или не существует.
# 8. Получите список всех ключей словаря `student` и выведите его на экран.
# 9. Получите список всех значений словаря `student` и выведите его на экран.